Autodesk.Revit.DB.FabricationConfiguration.GetItemFoldersUsedByServices(System.Collections.Generic.IList{System.Int32})
Gets a list of every fabrication item folder used by services.
serviceIds:
list of service ids to check.
Returns:
Returns a list of every fabrication item folder used by services.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016